
#Использовать datetime

имяПеременнойСреды = "OSCRIPT_TIMER_START";

// @set OSCRIPT_TIMER_START=%DATE:~0,2%.%DATE:~3,2%.%DATE:~6,4%_%TIME:~0,2%:%TIME:~3,2%:%TIME:~6,2%
// @set OSCRIPT_TIMER_START=%OSCRIPT_TIMER_START: =0%


Если АргументыКоманднойСтроки.Количество() = 1
	ИЛИ АргументыКоманднойСтроки.Количество() = 2
	И ВРег(АргументыКоманднойСтроки[1]) = "START" Тогда

	текВремя = ТекущаяДата();
	Сообщить("Старт: " + текВремя);

	УстановитьПеременнуюСреды(имяПеременнойСреды, Строка(текВремя), РасположениеПеременнойСреды.Процесс);

Иначе

	текВремя = ТекущаяДата();

	значениеПараметра = ПолучитьПеременнуюСреды(имяПеременнойСреды);
	значениеПараметра = СтрЗаменить(значениеПараметра, "_", " ");

	Попытка
		ДатаВремя = Новый ДатаВремя;
		времяСтарта = ДатаВремя.СтрокаВДату(значениеПараметра, "dd.MM.yyуу HH:mm:ss");
	Исключение
		Сообщить(ОписаниеОшибки());
		времяСтарта = Неопределено;
	КонецПопытки;

	Если Не ЗначениеЗаполнено(времяСтарта) Тогда
		Сообщить("Таймер: Не указано время старта");
	Иначе
		прошлоСекунд = текВремя - времяСтарта;
		Сообщить("Прошло: " + прошлоСекунд + "с");
	КонецЕсли;

КонецЕсли;